app/Controllers/Admin.php

SELECT MONTHNAME(tgl_pesan) as bulan_nama, SUM(total_harga) as total
FROM `orders`
WHERE YEAR(tgl_pesan) = '2026'
GROUP BY MONTH(tgl_pesan), MONTHNAME(tgl_pesan)
ORDER BY MONTH(tgl_pesan) ASC
SELECT `products`.`id`, `products`.`nama_produk`, `products`.`gambar`, SUM(product_sizes.stok) as total_stok
FROM `product_sizes`
JOIN `products` ON `products`.`id` = `product_sizes`.`product_id`
GROUP BY `product_sizes`.`product_id`
HAVING SUM(product_sizes.stok) <= 3
ORDER BY `total_stok` ASC
---
   public function index() {
    $db = \Config\Database::connect();

    // 1. Ambil data asli dari database untuk Grafik Omzet
    $results = $db->table('orders')
        ->select("MONTHNAME(tgl_pesan) as bulan_nama, SUM(total_harga) as total")
        ->where("YEAR(tgl_pesan)", date('Y'))
        ->groupBy("MONTH(tgl_pesan), MONTHNAME(tgl_pesan)")
        ->orderBy("MONTH(tgl_pesan)", "ASC")
        ->get()
        ->getResultArray();

    // 2. Mapping Data (Jan - Des) - Default 0
    $listBulan = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'];
    $dataBulanan = array_fill_keys($listBulan, 0);

    // Masukkan data asli dari database ke dalam array mapping $dataBulanan
    foreach ($results as $row) {
        $namaSingkat = substr($row['bulan_nama'], 0, 3);
        if (array_key_exists($namaSingkat, $dataBulanan)) {
            // Logika baru: Jika total di bawah 15.000, set ke 15.000 agar grafik konsisten
            // dengan batas 'min' di view Chart.js
            $total = (float)$row['total'];
            $dataBulanan[$namaSingkat] = ($total > 0 && $total < 15000) ? 15000 : $total;
        }
    }

    // 3. Ambil data Stok Menipis & Habis dari tabel product_sizes (UTS: Habis=0, Menipis<=3)
    $stokKritis = $db->table('product_sizes')
        ->select('products.id, products.nama_produk, products.gambar, SUM(product_sizes.stok) as total_stok')
        ->join('products', 'products.id = product_sizes.product_id')
        ->groupBy('product_sizes.product_id')
        ->having('SUM(product_sizes.stok) <=', 3)
        ->orderBy('total_stok', 'ASC')
        ->get()
        ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE DATE_FORMAT(tgl_pesan, '%Y-%m') = '2026-07'
AND `status_pembayaran` = 'sudah_bayar'
SELECT SUM(`total_harga`) AS `total_harga`
FROM `orders`
WHERE DATE_FORMAT(tgl_pesan, '%Y-%m') = '2026-07'
AND `status_pembayaran` != 'dibatalkan'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE DATE_FORMAT(tgl_pesan, '%Y-%m') = '2026-07'
---
    // 5. Statistik Bulan Ini
    $bulanIni = date('Y-m');

    $totalTransaksiBulanIni = $db->table('orders')
        ->where("DATE_FORMAT(tgl_pesan, '%Y-%m')", $bulanIni)
        ->where('status_pembayaran', 'sudah_bayar')
        ->countAllResults();

    $totalPendapatanBulanIni = $db->table('orders')
        ->where("DATE_FORMAT(tgl_pesan, '%Y-%m')", $bulanIni)
        ->where('status_pembayaran !=', 'dibatalkan')
        ->selectSum('total_harga')
        ->get()->getRow()->total_harga ?? 0;

    $totalPesananBulanIni = $db->table('orders')
        ->where("DATE_FORMAT(tgl_pesan, '%Y-%m')", $bulanIni)
        ->countAllResults();

SELECT SUM(`total_harga`) AS `total_harga`
FROM `orders`
WHERE DATE_FORMAT(tgl_pesan, '%Y-%m') = '2026-06'
AND `status_pembayaran` != 'dibatalkan'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE DATE_FORMAT(tgl_pesan, '%Y-%m') = '2026-06'
---
    // Data Bulan Lalu (untuk perbandingan tren)
    $bulanLalu = date('Y-m', strtotime('-1 month'));

    $pendapatanBulanLalu = $db->table('orders')
        ->where("DATE_FORMAT(tgl_pesan, '%Y-%m')", $bulanLalu)
        ->where('status_pembayaran !=', 'dibatalkan')
        ->selectSum('total_harga')
        ->get()->getRow()->total_harga ?? 0;

    $pesananBulanLalu = $db->table('orders')
        ->where("DATE_FORMAT(tgl_pesan, '%Y-%m')", $bulanLalu)
        ->countAllResults();

SELECT DATE(tgl_pesan) as tanggal, SUM(total_harga) as total
FROM `orders`
WHERE `tgl_pesan` >= '2026-07-12'
AND `status_pembayaran` != 'dibatalkan'
GROUP BY DATE(tgl_pesan)
ORDER BY `tanggal` ASC
---
    // ============================================================
    // 6. Grafik Penjualan 7 Hari Terakhir
    // (✅ DIUBAH atas permintaan: sebelumnya 30 hari, sekarang 7 hari)
    // ============================================================
    $hasil7Hari = $db->table('orders')
        ->select("DATE(tgl_pesan) as tanggal, SUM(total_harga) as total")
        ->where('tgl_pesan >=', date('Y-m-d', strtotime('-6 days')))
        ->where('status_pembayaran !=', 'dibatalkan')
        ->groupBy('DATE(tgl_pesan)')
        ->orderBy('tanggal', 'ASC')
        ->get()
        ->getResultArray();

SELECT `products`.`id`, `products`.`nama_produk`, `products`.`gambar`, SUM(product_sizes.stok) as total_stok
FROM `product_sizes`
JOIN `products` ON `products`.`id` = `product_sizes`.`product_id`
GROUP BY `product_sizes`.`product_id`
HAVING SUM(product_sizes.stok) = 0
SELECT `products`.`id`, `products`.`nama_produk`, `products`.`gambar`, SUM(product_sizes.stok) as total_stok
FROM `product_sizes`
JOIN `products` ON `products`.`id` = `product_sizes`.`product_id`
GROUP BY `product_sizes`.`product_id`
HAVING SUM(product_sizes.stok) > 0
AND SUM(product_sizes.stok) <= 3
---
    }

    // 8. MONITORING STOK — Habis (=0) & Menipis (<=3)  (UTS E-Business)
    // ============================================================
    $stokHabis = $db->table('product_sizes')
        ->select('products.id, products.nama_produk, products.gambar, SUM(product_sizes.stok) as total_stok')
        ->join('products', 'products.id = product_sizes.product_id')
        ->groupBy('product_sizes.product_id')
        ->having('SUM(product_sizes.stok) =', 0)
        ->get()
        ->getResultArray();

    $stokMenipis = $db->table('product_sizes')
        ->select('products.id, products.nama_produk, products.gambar, SUM(product_sizes.stok) as total_stok')
        ->join('products', 'products.id = product_sizes.product_id')
        ->groupBy('product_sizes.product_id')
        ->having('SUM(product_sizes.stok) > 0')
        ->having('SUM(product_sizes.stok) <=', 3)
        ->get()
        ->getResultArray();

SELECT `products`.`id`, `products`.`nama_produk`, `products`.`gambar`, SUM(order_items.jumlah) as total_terjual
FROM `order_items`
JOIN `products` ON `products`.`id` = `order_items`.`product_id`
JOIN `orders` ON `orders`.`id` = `order_items`.`order_id`
WHERE `orders`.`status_pembayaran` != 'dibatalkan'
GROUP BY `products`.`id`
ORDER BY `total_terjual` DESC
 LIMIT 5
---
    // ============================================================

    // 7. PRODUK TERLARIS (UTS E-Business — Top 5)
    // ============================================================
    $produkTerlaris = $db->table('order_items')
        ->select('products.id, products.nama_produk, products.gambar, SUM(order_items.jumlah) as total_terjual')
        ->join('products', 'products.id = order_items.product_id')
        ->join('orders', 'orders.id = order_items.order_id')
        ->where('orders.status_pembayaran !=', 'dibatalkan')
        ->groupBy('products.id')
        ->orderBy('total_terjual', 'DESC')
        ->limit(5)
        ->get()
        ->getResultArray();

SELECT SUM(`total_harga`) AS `total_harga`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    // ============================================================

    // 4. Persiapkan data untuk dikirim ke view
    $data = [
        'omzet'             => $db->table('orders')->selectSum('total_harga')->get()->getRow()->total_harga ?? 0,
        'total_pesanan'     => $db->table('orders')->countAllResults(),
        'total_produk'      => $db->table('products')->countAllResults(),

        // Data Stok Kritis hasil JOIN
        'stok_tipis_count'  => count($stokKritis),
        'stok_tipis_list'   => $stokKritis,

        // Data Grafik (Sekarang $dataBulanan sudah didefinisikan di atas)
        'chart_labels'      => json_encode(array_keys($dataBulanan)),
        'chart_data'        => json_encode(array_values($dataBulanan), JSON_NUMERIC_CHECK),

        // ⬇️ Tambahan Dashboard Penjualan Bulanan
        'total_transaksi_bulan_ini'   => $totalTransaksiBulanIni,
        'total_pendapatan_bulan_ini'  => $totalPendapatanBulanIni,
        'total_pesanan_bulan_ini'     => $totalPesananBulanIni,
        'rata_rata_transaksi'         => $rataRataTransaksi,
        'trend_pendapatan'            => $trendPendapatan,
        'trend_pesanan'               => $trendPesanan,

        // ✅ DIUBAH: dari 30 hari jadi 7 hari terakhir (nama variabel tetap

SELECT `products`.*, SUM(product_sizes.stok) as total_stok
FROM `products`
LEFT JOIN `product_sizes` ON `product_sizes`.`product_id` = `products`.`id`
GROUP BY `products`.`id`
---
   public function produk() {
    $db = \Config\Database::connect();

    // Query ini menggabungkan tabel products dengan product_sizes
    // Lalu menjumlahkan (SUM) semua stok berdasarkan ID produk
    $builder = $db->table('products')
                  ->select('products.*, SUM(product_sizes.stok) as total_stok')
                  ->join('product_sizes', 'product_sizes.product_id = products.id', 'left')
                  ->groupBy('products.id');

    // Fitur Search
    $search = $this->request->getGet('search');
    if ($search) {
        $builder->groupStart()
                ->like('nama_produk', $search)
                ->orLike('products.id', $search)
                ->groupEnd();
    }

    // Fitur Sortir menggunakan alias 'total_stok'
    $sort = $this->request->getGet('sort');
    if ($sort == 'stok_asc') $builder->orderBy('total_stok', 'ASC');
    if ($sort == 'harga_desc') $builder->orderBy('harga', 'DESC');

    $data = [
        'title'    => 'Manajemen Produk - Sport Center', // Judul dinamis
        'products' => $builder->get()->getResultArray(),

SELECT *
FROM `users`
---
    public function blokir_user($id)
    {
        $db   = \Config\Database::connect();
        $user = $db->table('users')->where('id', $id)->get()->getRowArray();

        if (!$user) {
            return redirect()->to(base_url('admin/user'))->with('error', 'User tidak ditemukan.');

SELECT *
FROM `users`
---
    public function aktifkan_user($id)
    {
        $db   = \Config\Database::connect();
        $user = $db->table('users')->where('id', $id)->get()->getRowArray();

        if (!$user) {
            return redirect()->to(base_url('admin/user'))->with('error', 'User tidak ditemukan.');
        }

        $db->table('users')->where('id', $id)->update(['status' => 'aktif']);

        return redirect()->to(base_url('admin/user'))
                         ->with('success', 'Akun @' . $user['username'] . ' berhasil diaktifkan kembali.');

SELECT SUM(`total_harga`) AS `total_harga`
FROM `orders`
SELECT *
FROM `orders`
ORDER BY `tgl_pesan` DESC
---
public function transaksi()
{
    $db = \Config\Database::connect();

    // 1. Mengambil total saldo dari kolom total_harga
    $queryTotal = $db->table('orders')->selectSum('total_harga')->get();
    $data['total_masuk'] = $queryTotal->getRow()->total_harga ?? 0;

    // 2. Mengambil semua data dari tabel orders untuk tabel 'Transaksi Terakhir'
    // Variabel ini yang sebelumnya hilang sehingga menyebabkan error
    $data['transaksi'] = $db->table('orders')
                            ->orderBy('tgl_pesan', 'DESC')
                            ->get()
                            ->getResultArray();

SELECT `order_items`.`order_id`, `order_items`.`jumlah`, `order_items`.`subtotal`, `products`.`nama_produk`
FROM `order_items`
LEFT JOIN `products` ON `products`.`id` = `order_items`.`product_id`
SELECT `orders`.*, `users`.`username`
FROM `orders`
LEFT JOIN `users` ON `users`.`id` = `orders`.`user_id`
ORDER BY `orders`.`tgl_pesan` DESC
---
    public function invoices()
{
    // 1. Hubungkan ke database dengan cara yang benar
    $db = \Config\Database::connect();

    // 2. Query data dengan chaining yang benar
    $invoices = $db->table('orders')
                           ->select('orders.*, users.username')
                           ->join('users', 'users.id = orders.user_id', 'left')
                           ->orderBy('orders.tgl_pesan', 'DESC') // Urutkan dari yang terbaru
                           ->get()
                           ->getResultArray();

    // ✅ BARU: ambil semua item pesanan sekaligus (1 query, bukan query
    // di dalam loop), lalu kelompokkan per order_id di PHP. Dipakai untuk
    // tombol "Lihat" yang sebelumnya dead link (href="#").
    $semuaItem = $db->table('order_items')
                    ->select('order_items.order_id, order_items.jumlah, order_items.subtotal, products.nama_produk')
                    ->join('products', 'products.id = order_items.product_id', 'left')
                    ->get()->getResultArray();

SELECT SUM(`order_items`.`jumlah`) AS `total`
FROM `order_items`
JOIN `orders` ON `orders`.`id` = `order_items`.`order_id`
WHERE `orders`.`status_pembayaran` != 'dibatalkan'
SELECT SUM(`total_harga`) AS `total`
FROM `orders`
WHERE `status_pembayaran` != 'dibatalkan'
SELECT `products`.`nama_produk`, SUM(order_items.jumlah) as total
FROM `order_items`
JOIN `products` ON `products`.`id` = `order_items`.`product_id`
JOIN `orders` ON `orders`.`id` = `order_items`.`order_id`
WHERE `orders`.`status_pembayaran` != 'dibatalkan'
GROUP BY `products`.`id`
ORDER BY `total` DESC
 LIMIT 1
SELECT DATE_FORMAT(tgl_pesan, '%M %Y') as bulan, COUNT(*) as jumlah_pesanan, SUM(total_harga) as total_pendapatan
FROM `orders`
WHERE `status_pembayaran` != 'dibatalkan'
GROUP BY `bulan`
ORDER BY MAX(tgl_pesan) DESC
---
    public function laporan()
{
    $db = \Config\Database::connect();

    // Kita ambil SEMUA data KECUALI yang 'dibatalkan'
    $statusTidakDihitung = 'dibatalkan';

    // 1. Total Barang Terjual (Semua pesanan yang tidak dibatalkan)
    $totalQty = $db->table('order_items')
                   ->join('orders', 'orders.id = order_items.order_id')
                   ->where('orders.status_pembayaran !=', $statusTidakDihitung)
                   ->selectSum('order_items.jumlah', 'total')
                   ->get()->getRow();

    // 2. Omset (Semua pesanan yang tidak dibatalkan)
    $omset = $db->table('orders')
                ->where('status_pembayaran !=', $statusTidakDihitung)
                ->selectSum('total_harga', 'total')
                ->get()->getRow();

    // 3. Produk Terlaris (Semua yang tidak dibatalkan)
    $terlaris = $db->table('order_items')
                   ->select('products.nama_produk, SUM(order_items.jumlah) as total')
                   ->join('products', 'products.id = order_items.product_id')
                   ->join('orders', 'orders.id = order_items.order_id')
                   ->where('orders.status_pembayaran !=', $statusTidakDihitung)
                   ->groupBy('products.id')
                   ->orderBy('total', 'DESC')
                   ->limit(1)
                   ->get()->getRow();

    // 4. Riwayat Penjualan
    $riwayat = $db->table('orders')
                  ->where('status_pembayaran !=', $statusTidakDihitung)
                  ->select("DATE_FORMAT(tgl_pesan, '%M %Y') as bulan, COUNT(*) as jumlah_pesanan, SUM(total_harga) as total_pendapatan")
                  ->groupBy('bulan')
                  ->orderBy("MAX(tgl_pesan)", "DESC")
                  ->get()->getResultArray();