app/Controllers/Admin.php

    public function laporan()
{
    $db = \Config\Database::connect();

    // Kita ambil SEMUA data KECUALI yang 'dibatalkan'
    $statusTidakDihitung = 'dibatalkan';

    // 1. Total Barang Terjual (Semua pesanan yang tidak dibatalkan)
    $totalQty = $db->table('order_items')
                   ->join('orders', 'orders.id = order_items.order_id')
                   ->where('orders.status_pembayaran !=', $statusTidakDihitung)
                   ->selectSum('order_items.jumlah', 'total')
                   ->get()->getRow();

    // 2. Omset (Semua pesanan yang tidak dibatalkan)
    $omset = $db->table('orders')
                ->where('status_pembayaran !=', $statusTidakDihitung)
                ->selectSum('total_harga', 'total')
                ->get()->getRow();

    // 3. Produk Terlaris (Semua yang tidak dibatalkan)
    $terlaris = $db->table('order_items')
                   ->select('products.nama_produk, SUM(order_items.jumlah) as total')
                   ->join('products', 'products.id = order_items.product_id')
                   ->join('orders', 'orders.id = order_items.order_id')
                   ->where('orders.status_pembayaran !=', $statusTidakDihitung)
                   ->groupBy('products.id')
                   ->orderBy('total', 'DESC')
                   ->limit(1)
                   ->get()->getRow();

    // 4. Riwayat Penjualan
    $riwayat = $db->table('orders')
                  ->where('status_pembayaran !=', $statusTidakDihitung)
                  ->select("DATE_FORMAT(tgl_pesan, '%M %Y') as bulan, COUNT(*) as jumlah_pesanan, SUM(total_harga) as total_pendapatan")
                  ->groupBy('bulan')
                  ->orderBy("MAX(tgl_pesan)", "DESC")
                  ->get()->getResultArray();
---
SELECT SUM(`order_items`.`jumlah`) AS `total`
FROM `order_items`
JOIN `orders` ON `orders`.`id` = `order_items`.`order_id`
WHERE `orders`.`status_pembayaran` != 'dibatalkan'
SELECT SUM(`total_harga`) AS `total`
FROM `orders`
WHERE `status_pembayaran` != 'dibatalkan'
SELECT `products`.`nama_produk`, SUM(order_items.jumlah) as total
FROM `order_items`
JOIN `products` ON `products`.`id` = `order_items`.`product_id`
JOIN `orders` ON `orders`.`id` = `order_items`.`order_id`
WHERE `orders`.`status_pembayaran` != 'dibatalkan'
GROUP BY `products`.`id`
ORDER BY `total` DESC
 LIMIT 1
SELECT DATE_FORMAT(tgl_pesan, '%M %Y') as bulan, COUNT(*) as jumlah_pesanan, SUM(total_harga) as total_pendapatan
FROM `orders`
WHERE `status_pembayaran` != 'dibatalkan'
GROUP BY `bulan`
ORDER BY MAX(tgl_pesan) DESC