app/Controllers/Auth.php

    public function proses_register() {
        $model = new UserModel();

        // Menarik seluruh input dari form register view (Password disimpan teks biasa)
        $data = [
            'username'       => $this->request->getPost('username'),
            'password'       => $this->request->getPost('password'), // Diubah: Tidak menggunakan hash lagi
            'role'           => 'pelanggan',
            'nama'           => $this->request->getPost('nama'),
            'no_hp'          => $this->request->getPost('no_hp'),
            'provinsi'       => $this->request->getPost('provinsi'),
            'kota'           => $this->request->getPost('kota'),
            'kecamatan'      => $this->request->getPost('kecamatan'),
            'desa'           => $this->request->getPost('desa'),
            'alamat_lengkap' => $this->request->getPost('alamat_lengkap'),
        ];

        // Proteksi double username
        $cek = $model->where('username', $data['username'])->first();
        if ($cek) {
            return redirect()->back()->withInput()->with('error', 'Username sudah digunakan!');
        }

        if ($model->insert($data)) {
---
SELECT *
FROM `users`
WHERE `username` = 'kismi'
 LIMIT 1
INSERT INTO `users` (`username`, `password`, `role`, `nama`, `no_hp`, `provinsi`, `kota`, `kecamatan`, `desa`, `alamat_lengkap`) VALUES ('kismi', 'kismi123', 'pelanggan', 'kismiati', '088212345678', 'Jawa Tengah', 'pekalongan', 'tirto', 'tirto', 'jln raya tirto')

    public function attemptLogin()
    {
        $model = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $role_target = $this->request->getPost('role');

        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1