app/Controllers/Pelanggan.php

SELECT `products`.*, SUM(product_sizes.stok) as total_stok
FROM `products`
LEFT JOIN `product_sizes` ON `product_sizes`.`product_id` = `products`.`id`
GROUP BY `products`.`id`
---
    public function index()
    {
        $db = \Config\Database::connect();

        // ✅ FIX: sebelumnya pakai ProductModel::findAll() tanpa join ke
        // product_sizes, jadi halaman pelanggan tidak tahu stok produk
        // (produk stok 0 tetap bisa ditambahkan ke keranjang / dibeli).
        $products = $db->table('products')
            ->select('products.*, SUM(product_sizes.stok) as total_stok')
            ->join('product_sizes', 'product_sizes.product_id = products.id', 'left')
            ->groupBy('products.id')
            ->get()->getResultArray();

SELECT `cart`.`id` as `id_keranjang`, `cart`.`jumlah`, `products`.`nama_produk`, `products`.`harga`, `products`.`gambar`
FROM `cart`
JOIN `products` ON `products`.`id` = `cart`.`product_id`
WHERE `cart`.`user_id` = '5'
---
    public function keranjang()
    {
        $id_user = session()->get('id');
        $db = \Config\Database::connect();

        $data['active'] = 'keranjang';
        $data['items']  = $db->table('cart')
            ->select('cart.id as id_keranjang, cart.jumlah, products.nama_produk, products.harga, products.gambar')
            ->join('products', 'products.id = cart.product_id')
            ->where('cart.user_id', $id_user)
            ->get()->getResultArray();

SELECT *
FROM `products`
WHERE `id` = '1'
SELECT *
FROM `product_sizes`
WHERE `id` = '3'
SELECT *
FROM `wilayah`
SELECT *
FROM `product_sizes`
WHERE `id` = '1'
---
    public function ringkasan_pesanan($id_produk, $id_size)
    {
        $db             = \Config\Database::connect();
        $produk         = $db->table('products')->where('id', $id_produk)->get()->getRowArray();
        $ukuran         = $db->table('product_sizes')->where('id', $id_size)->get()->getRowArray();
        $daftar_wilayah = $db->table('wilayah')->get()->getResultArray();

        $data = [
            'produk'           => $produk,
            'ukuran_pilihan'   => $ukuran,
            'wilayah'          => $daftar_wilayah,
            'alamat_admin'     => $this->alamat_admin,
            'active'           => 'home',
            'harga_asli'       => $produk['harga'],
            'biaya_layanan'    => 1000,
            'biaya_penanganan' => 500,
            'user_nama'        => session()->get('nama'),
            'user_telp'        => session()->get('no_hp'),
            'user_alamat'      => session()->get('alamat_lengkap'),
            'user_kota'        => session()->get('kota')
        ];

SELECT `cart`.`id` as `id_keranjang`, `cart`.`jumlah`, `cart`.`product_id`, `products`.`nama_produk`, `products`.`harga`, `products`.`diskon`, `products`.`gambar`
FROM `cart`
JOIN `products` ON `products`.`id` = `cart`.`product_id`
WHERE `cart`.`user_id` = '2'
AND `cart`.`id` IN ('4')
---
    public function proses_pilihan()
    {
        $id_keranjang_arr = $this->request->getPost('id_keranjang');

        if (empty($id_keranjang_arr)) {
            return redirect()->back()->with('error', 'Pilih minimal satu barang terlebih dahulu!');
        }

        $db      = \Config\Database::connect();
        $id_user = session()->get('id');

        $items = $db->table('cart')
            ->select('cart.id as id_keranjang, cart.jumlah, cart.product_id,
                      products.nama_produk, products.harga, products.diskon, products.gambar')
            ->join('products', 'products.id = cart.product_id')
            ->where('cart.user_id', $id_user)
            ->whereIn('cart.id', $id_keranjang_arr)
            ->get()
            ->getResultArray();

SELECT *
FROM `wilayah`
---
            $subtotal   += $harga_final * $item['jumlah'];
        }

        $daftar_wilayah = $db->table('wilayah')->get()->getResultArray();

INSERT INTO `orders` (`user_id`, `alamat_pengiriman`, `total_harga`, `ongkir`, `biaya_layanan`, `biaya_penanganan`, `metode_pembayaran`, `status_pembayaran`, `status_pengiriman`, `tgl_pesan`) VALUES ('2', 'jl.tunggul susukan comal', 22250, 5000, 1000, 500, 'cod', 'belum_bayar', 'diproses', '2026-07-13 07:01:39')
---
    public function proses_pesanan()
    {
        $userId = session()->get('id');
        $db     = \Config\Database::connect();
        $batas  = self::BATAS_MAKS;

        $total_harga      = (float) $this->request->getPost('total_harga');
        $ongkir           = (int)   $this->request->getPost('ongkir');
        $biaya_layanan    = (int)   $this->request->getPost('biaya_layanan');
        $biaya_penanganan = (int)   $this->request->getPost('biaya_penanganan');
        $metode           = $this->request->getPost('metode');
        $kota_tujuan      = $this->request->getPost('kota_tujuan');
        $dari_keranjang   = $this->request->getPost('dari_keranjang');
        $id_keranjang_arr = $this->request->getPost('id_keranjang') ?? [];
        $id_produk        = $this->request->getPost('id_produk');
        $id_size          = $this->request->getPost('id_size');
        $alamat           = session()->get('alamat_lengkap');

        if (empty($metode) || empty($kota_tujuan)) {
            return redirect()->back()->with('error', 'Pilih metode pembayaran dan kota tujuan!');
        }
        if (empty($alamat)) {
            return redirect()->to(base_url('pelanggan/edit_profile'))
                             ->with('error', 'Lengkapi alamat pengiriman terlebih dahulu!');
        }

        $db->transBegin();

        try {
            // A. Insert order
            $db->table('orders')->insert([
                'user_id'           => $userId,
                'alamat_pengiriman' => $alamat,
                'total_harga'       => $total_harga,
                'ongkir'            => $ongkir,
                'biaya_layanan'     => $biaya_layanan,
                'biaya_penanganan'  => $biaya_penanganan,
                'metode_pembayaran' => strtolower(trim($metode)),
                'status_pembayaran' => 'belum_bayar',
                'status_pengiriman' => 'diproses',
                'tgl_pesan'         => date('Y-m-d H:i:s'),
            ]);

SELECT `cart`.*, `products`.`nama_produk`, `products`.`harga`, `products`.`diskon`
FROM `cart`
JOIN `products` ON `products`.`id` = `cart`.`product_id`
WHERE `cart`.`id` = 3
---
                foreach ($id_keranjang_arr as $idk) {
                    $cartItem = $db->table('cart')
                        // ✅ FIX: tambah products.nama_produk supaya bisa
                        // disimpan sebagai snapshot di order_items
                        ->select('cart.*, products.nama_produk, products.harga, products.diskon')
                        ->join('products', 'products.id = cart.product_id')
                        ->where('cart.id', (int)$idk)
                        ->get()->getRowArray();

INSERT INTO `order_items` (`order_id`, `product_id`, `product_size_id`, `nama_produk`, `harga_satuan`, `jumlah`, `subtotal`) VALUES (3, '1', NULL, 'Celana Sport Adidas', 15750, '1', 15750)
DELETE FROM `cart`
WHERE `id` = 3
---
                    $harga_final = $cartItem['harga'] - ($cartItem['harga'] * ($cartItem['diskon'] / 100));
                    $subtotal    = $harga_final * $cartItem['jumlah'];

                    $db->table('order_items')->insert([
                        'order_id'        => $orderId,
                        'product_id'      => $cartItem['product_id'],
                        // ⬇️ product_size_id TETAP NULL di jalur ini - tabel
                        // cart belum menyimpan ukuran (perbaikan terpisah)
                        'product_size_id' => null,
                        'nama_produk'     => $cartItem['nama_produk'],
                        'harga_satuan'    => (int) round($harga_final),
                        'jumlah'          => $cartItem['jumlah'],
                        'subtotal'        => $subtotal,
                    ]);

                    $db->table('cart')->delete(['id' => (int)$idk]);

SELECT *
FROM `orders`
WHERE `user_id` = '2'
ORDER BY `id` DESC
---
    public function orders()
    {
        $db     = \Config\Database::connect();
        $userId = session()->get('id');
        $data   = [
            'title'  => 'Pesanan Saya',
            'active' => 'profile',
            'orders' => $db->table('orders')
                           ->where('user_id', $userId)
                           ->orderBy('id', 'DESC')
                           ->get()->getResultArray()