app/Controllers/Pelanggan.php

SELECT *
FROM `products`
---
    public function index()
    {
        $model = new ProductModel();
        $data = [
            'active'   => 'home',
            'products' => $model->findAll()

INSERT INTO `orders` (`user_id`, `alamat_pengiriman`, `total_harga`, `ongkir`, `biaya_layanan`, `biaya_penanganan`, `metode_pembayaran`, `status_pembayaran`, `status_pengiriman`, `tgl_pesan`) VALUES ('5', 'Jl.Raya Utama Ciawi No.10', 29250, 12000, 1000, 500, 'va_bank', 'belum_bayar', 'diproses', '2026-06-26 10:32:09')
---
    public function proses_pesanan()
    {
        $userId = session()->get('id');
        $db     = \Config\Database::connect();
        $batas  = self::BATAS_MAKS;

        $total_harga      = (float) $this->request->getPost('total_harga');
        $ongkir           = (int)   $this->request->getPost('ongkir');
        $biaya_layanan    = (int)   $this->request->getPost('biaya_layanan');
        $biaya_penanganan = (int)   $this->request->getPost('biaya_penanganan');
        $metode           = $this->request->getPost('metode');
        $kota_tujuan      = $this->request->getPost('kota_tujuan');
        $dari_keranjang   = $this->request->getPost('dari_keranjang');
        $id_keranjang_arr = $this->request->getPost('id_keranjang') ?? [];
        $id_produk        = $this->request->getPost('id_produk');
        $id_size          = $this->request->getPost('id_size');
        $alamat           = session()->get('alamat_lengkap');

        if (empty($metode) || empty($kota_tujuan)) {
            return redirect()->back()->with('error', 'Pilih metode pembayaran dan kota tujuan!');
        }
        if (empty($alamat)) {
            return redirect()->to(base_url('pelanggan/edit_profile'))
                             ->with('error', 'Lengkapi alamat pengiriman terlebih dahulu!');
        }

        $db->transBegin();

        try {
            // A. Insert order
            $db->table('orders')->insert([
                'user_id'           => $userId,
                'alamat_pengiriman' => $alamat,
                'total_harga'       => $total_harga,
                'ongkir'            => $ongkir,
                'biaya_layanan'     => $biaya_layanan,
                'biaya_penanganan'  => $biaya_penanganan,
                'metode_pembayaran' => strtolower(trim($metode)),
                'status_pembayaran' => 'belum_bayar',
                'status_pengiriman' => 'diproses',
                'tgl_pesan'         => date('Y-m-d H:i:s'),
            ]);

SELECT *
FROM `products`
WHERE `id` = '1'
---
                    throw new \Exception('Data produk tidak lengkap.');
                }

                $produk = $db->table('products')->where('id', $id_produk)->get()->getRowArray();

INSERT INTO `order_items` (`order_id`, `product_id`, `jumlah`, `subtotal`) VALUES (5, '1', 1, 15750)
SELECT *
FROM `product_sizes`
WHERE `id` = '3'
UPDATE `product_sizes` SET `stok` = 7
WHERE `id` = '3'
---
                $disc_persen = $produk['diskon'] ?? 0;
                $harga_final = $produk['harga'] - ($produk['harga'] * $disc_persen / 100);

                $db->table('order_items')->insert([
                    'order_id'   => $orderId,
                    'product_id' => $id_produk,
                    'jumlah'     => 1,
                    'subtotal'   => $harga_final,
                ]);

                $itemSize = $db->table('product_sizes')->where('id', $id_size)->get()->getRow();
                if (!$itemSize || $itemSize->stok < 1) {
                    throw new \Exception('Stok untuk ukuran ini sudah habis.');
                }
                $db->table('product_sizes')
                   ->where('id', $id_size)
                   ->update(['stok' => $itemSize->stok - 1]);

SELECT *
FROM `orders`
WHERE `user_id` = '5'
ORDER BY `id` DESC
---
    public function orders()
    {
        $db     = \Config\Database::connect();
        $userId = session()->get('id');
        $data   = [
            'title'  => 'Pesanan Saya',
            'active' => 'profile',
            'orders' => $db->table('orders')
                           ->where('user_id', $userId)
                           ->orderBy('id', 'DESC')
                           ->get()->getResultArray()

SELECT *
FROM `orders`
WHERE `orders`.`id` = '2'
---
    public function upload_bukti($order_id)
    {
        $orderModel = new \App\Models\OrderModel();
        $order = $orderModel->find($order_id);